{
    "name": "papascott",
    "text": "<p>This didn't actually turn out the way I planned…</p><p>I thought that using git from a callback would be just like using it when I'm using it to save code. Do 'git status' to see what needs to be done, 'git add' to set up what to commit, 'git commit' to save to the local repository, and finally 'git push' to send the changes to GitHub.&nbsp;</p><p>Since the simple-git module is included with nodeStorage, it can be simply loaded into our callback. In theory it would just be</p><p></p><blockquote>var ghRoot = \"/home/shanson/test-rhino\"; //where I cloned the repository<br>var simpleGit = require('simple-git')(ghRoot); <br>filesystem.newObject(ghRoot + '/' + relpath, body); <br>simpleGit.status().add('.').commit('Updated from 1999.io').push();</blockquote><p></p><p>This works when testing with a single file. When I actually put it in a callback, I sometimes get errors when trying to push. The reason is when updating a post, the callback is called on 5 different files simultaneously. That's no problem when just writing files, but when they all try to push to GitHub over the network at the same time, some of them will fail.</p><p>I wasn't sure how to get the callbacks to keep track of what the others were doing, and for the time being I came up with a kludge. I only run the simpleGit commands for rss.xml (which gets written on every update), and using setTimeout I wait 5 seconds before doing so (since all the callbacks seems to complete in about 1 second, 5 seconds should be long enough for them to complete). My script is saved as a <a href=\"https://gist.github.com/papascott/03f48a0bb553619f2f74789716e857b2\">gist</a>.</p><p>It's a interim solution, a kludge, it works well enough for my purposes, but I wouldn't recommend it for anybody else. However, GitHub does have an API where you can take actions without a local repository. Maybe that will work better? Stay tuned.</p><p></p>",
    "id": 3,
    "when": "2016-09-16T12:00:28.372Z",
    "payload": {
        "editor": "wizzy",
        "urlRendering": "http://test-blog.papascott.de/2016/09/16/push1999ioToGithub.html",
        "title": "Copy 1999.io files to GitHub 2",
        "fnameHtml": "push1999ioToGithub.html"
    },
    "urlJson": "http://test-blog.papascott.de/2016/09/16/0003.json",
    "subs": [],
    "whenLastUpdate": "2016-09-16T12:29:53.700Z",
    "ctUpdates": 13
}